In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('new_data_articles_with_sentiment.csv',index_col=0)

In [3]:
df.head()

,published_date,company,title,body,url,compound,neg,neu,pos
0,2016-01-28 21:06:10+00:00,FB,US STOCKS SNAPSHOT-Wall St ends up sharply on ...,"NEW YORK, Aug 16 (Reuters) - U.S. stocks rebou...",https://www.reuters.com/article/usa-stocks/us-...,0.5423,0.000,0.741,0.259
1,2016-02-18 21:05:42+00:00,WMT,"US STOCKS SNAPSHOT-S&P, Dow eke out gains afte...","NEW YORK, Sept 6 (Reuters) - The S&P 500 and t...",https://www.reuters.com/article/usa-stocks/us-...,0.3400,0.000,0.806,0.194
2,2016-03-02 22:09:26+00:00,AAPL,US STOCKS SNAPSHOT-Wall Street ends mixed as M...,Sept 19 (Reuters) - Wall Street ended mixed on...,https://www.reuters.com/article/usa-stocks/us-...,0.0000,0.000,1.000,0.000
3,2016-03-02 22:09:26+00:00,MSFT,US STOCKS SNAPSHOT-Wall Street ends mixed as M...,Sept 19 (Reuters) - Wall Street ended mixed on...,https://www.reuters.com/article/usa-stocks/us-...,0.0000,0.000,1.000,0.000
4,2016-03-31 20:05:35+00:00,BA,"US STOCKS SNAPSHOT-Boeing, J&J pull down Wall ...","NEW YORK, Oct 18 (Reuters) - Wall Street fell ...",https://www.reuters.com/article/usa-stocks/us-...,-0.4404,0.195,0.805,0.000

In [4]:
df2=df.copy()
df2=pd.DataFrame(df2)
n=df.shape[0]

In [5]:
for i in range(0,n):
    
    df2['published_date'][i]=df2['published_date'][i][0:10]
    if i%10000==0:
        print(i)
df2.to_csv('sentiment.csv')

C:\Users\YuNan\anaconda3\envs\tf-gpu\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

0
10000
20000

In[15]:

In [6]:
df2['company'].unique()

array(['FB', 'WMT', 'AAPL', 'MSFT', 'BA', 'JNJ', 'CSCO', 'TSLA', 'AMZN',
       'TWTR', 'CVS', 'DIS', 'XOM', 'GS', 'T', 'CME', 'AVGO', 'QCOM',
       'NVDA', 'WBA', 'AIG', 'BAC', 'V', 'VZ', 'GOOG', 'GOOGL', 'MAR',
       'FDX', 'GE', 'DAL', 'LUV', 'MRK', 'AAL', 'CMCSA', 'GM', 'NKE',
       'BIIB', 'TGT', 'MET', 'XRX', 'KR', 'SO', 'PFE', 'IBM', 'JPM',
       'PEP', 'TMO', 'CAT', 'WFC', 'UNH', 'EBAY', 'OXY', 'SLB', 'BLK',
       'NFLX', 'AMGN', 'TSN', 'LMT', 'COP', 'FCX', 'HPQ', 'MCD', 'KO',
       'ABBV', 'TMUS', 'KHC', 'INTC', 'ABT', 'GILD', 'CVX', 'MA', 'LLY',
       'CB', 'ALB', 'VLO', 'REGN', 'MPC', 'CBOE', 'UAL', 'F', 'VIAC'],
      dtype=object)

In [7]:
# grouped=df2.groupby(['company']).size()
# print(grouped[:50])

# BA=df2.groupby(['company']).filter(lambda x: x=='BA')
# print(BA)

In [11]:
df2['company'].unique()[0]

'FB'

In [18]:
for i in range(df2['company'].unique().shape[0]):
    dff1 = df2[df2.company == df2['company'].unique()[i]]
    print(dff1.shape)
    dff1.to_csv('sentiment\sentiment_{}.csv'.format(df2['company'].unique()[i]),index = False)

(1663, 9)
(597, 9)
(1778, 9)
(537, 9)
(2234, 9)
(593, 9)
(110, 9)
(1464, 9)
(1645, 9)
(309, 9)
(216, 9)
(435, 9)
(711, 9)
(845, 9)
(352, 9)
(479, 9)
(130, 9)
(391, 9)
(168, 9)
(130, 9)
(126, 9)
(199, 9)
(114, 9)
(134, 9)
(541, 9)
(541, 9)
(103, 9)
(180, 9)
(452, 9)
(335, 9)
(277, 9)
(313, 9)
(296, 9)
(289, 9)
(712, 9)
(217, 9)
(149, 9)
(117, 9)
(107, 9)
(127, 9)
(109, 9)
(104, 9)
(1607, 9)
(191, 9)
(587, 9)
(107, 9)
(103, 9)
(114, 9)
(379, 9)
(104, 9)
(130, 9)
(190, 9)
(105, 9)
(367, 9)
(369, 9)
(168, 9)
(119, 9)
(241, 9)
(144, 9)
(108, 9)
(103, 9)
(217, 9)
(133, 9)
(228, 9)
(307, 9)
(111, 9)
(323, 9)
(122, 9)
(402, 9)
(388, 9)
(142, 9)
(162, 9)
(129, 9)
(108, 9)
(102, 9)
(189, 9)
(107, 9)
(289, 9)
(123, 9)
(300, 9)
(183, 9)

In [19]:
dff1=df2[(df2.company=='BA')]
print(dff1.shape)
# dff2=df2[(df2.source_name=='cnbc.com')]
# print(dff2.shape)
# dff3=df2[(df2.source_name=='fortune.com')]
# print(dff3.shape)
# dff4=df2[(df2.source_name=='reuters.com')]
# print(dff4.shape)

(2234, 9)

In [20]:
dff1 = pd.read_csv('sentiment\sentiment_BA.csv')
# dff2.to_csv('D://NeurIPS Workshop/data/sentiment_cnbc.csv')
# dff3.to_csv('D://NeurIPS Workshop/data/sentiment_fortune.csv')
# dff4.to_csv('D://NeurIPS Workshop/data/sentiment_reuters.csv')

In [21]:
dff1.head()

,published_date,company,title,body,url,compound,neg,neu,pos
0,2016-03-31,BA,"US STOCKS SNAPSHOT-Boeing, J&J pull down Wall ...","NEW YORK, Oct 18 (Reuters) - Wall Street fell ...",https://www.reuters.com/article/usa-stocks/us-...,-0.4404,0.195,0.805,0.0
1,2018-02-08,BA,AirAsia seen sticking with Airbus A330neo: source,SINGAPORE (Reuters) - AirAsia looks set to con...,https://www.reuters.com/article/us-singapore-a...,0.0000,0.000,1.000,0.0
2,2018-02-08,BA,AIRSHOW-AirAsia seen sticking with Airbus A330...,"(Adds details)\n\nSINGAPORE, Feb 8 (Reuters) -...",https://www.reuters.com/article/singapore-airs...,0.0000,0.000,1.000,0.0
3,2018-02-08,BA,UPDATE 1-S.Korea to buy next maritime patrol a...,"(Adds detail)\n\nSEOUL, Feb 8 (Reuters) - Sout...",https://www.reuters.com/article/southkorea-arm...,0.0000,0.000,1.000,0.0
4,2018-02-08,BA,IranAir CEO says no problems financing plane d...,"Paris, Feb 8 (Reuters) - IranAir is not having...",https://www.reuters.com/article/iran-airplanes...,-0.5994,0.450,0.550,0.0

In [22]:
sp = pd.read_csv("C:/Users/YuNan/Downloads/stock/historical_price/historical_price/BA_2015-12-30_2021-02-21_minute.csv")#,index_col=0)
sp=pd.DataFrame(sp)
sp.shape

(628810, 9)

In [23]:
dff1g=dff1.groupby(['published_date']).agg(['mean'])
print(dff1g.shape)
# dff2g=dff2.groupby(['published_date']).agg(['mean'])
# print(dff2g.shape)
# dff3g=dff3.groupby(['published_date']).agg(['mean'])
# print(dff3g.shape)
# dff4g=dff4.groupby(['published_date']).agg(['mean'])
# print(dff4g.shape)

(656, 4)

In [22]:
dff1g.to_csv('sentiment_BA_groupday.csv')
# dff2g.to_csv('D://NeurIPS Workshop/data/sentiment_cnbc_groupday.csv')
# dff3g.to_csv('D://NeurIPS Workshop/data/sentiment_fortune_groupday.csv')
# dff4g.to_csv('D://NeurIPS Workshop/data/sentiment_reuters_groupday.csv')

In [23]:
dff1g.columns

MultiIndex([('compound', 'mean'),
            (     'neg', 'mean'),
            (     'neu', 'mean'),
            (     'pos', 'mean')],
           )

In [24]:
d1 = pd.read_csv('sentiment_BA_groupday.csv')#,index_col=0)
# d2 = pd.read_csv("D://NeurIPS Workshop/data/sentiment_cnbc_groupday1.csv")
# d3 = pd.read_csv("D://NeurIPS Workshop/data/sentiment_fortune_groupday1.csv")
# d4 = pd.read_csv("D://NeurIPS Workshop/data/sentiment_reuters_groupday1.csv")
# d1=pd.DataFrame(d1)
# d1.head()

In [26]:
print(type(sp['t'][0]))
print(type(d1['published_date'][0]))
print(sp.head())
print(d1.head())

<class 'str'>
<class 'str'>
   Unnamed: 0        v        vw         o         c        h       l  \
0      788931    100.0  146.9000  146.9000  146.9000  146.900  146.90
1      788930  36605.0  147.2292  147.2200  147.1500  148.000  147.10
2         780   4350.0  147.0348  147.1024  147.0000  147.130  147.00
3         779   2313.0  146.9455  146.9200  146.9700  146.975  146.91
4         778   3789.0  146.9338  146.9700  146.9332  147.000  146.85

                     t     n
0  2015-12-30 13:37:00   1.0
1  2015-12-30 14:30:00  78.0
2  2015-12-30 14:31:00  50.0
3  2015-12-30 14:32:00  35.0
4  2015-12-30 14:33:00  32.0
  published_date  compound    neg       neu       pos
0      3/31/2016 -0.440400  0.195  0.805000  0.000000
1       2/8/2018 -0.133200  0.100  0.900000  0.000000
2       2/9/2018  0.153100  0.000  0.882000  0.118000
3      2/13/2018  0.357175  0.000  0.774000  0.226000
4      2/14/2018  0.009267  0.183  0.604667  0.212333

In [31]:
sp1=sp.copy()
m=sp.shape[0]

In [32]:
for i in range (0,3):
    print(i)
    sp1['t'][i].replace('-','/')

0
1
2

In [37]:
print(sp1['t'][0])

2015-12-30 13:37:00

In [38]:
sp1['t'][0]==d1['published_date'][0]
print(sp1['t'][0])
print(d1['published_date'][0])

2015-12-30 13:37:00
3/31/2016

In [40]:
import time
t=d1['published_date'][0]
timeStruct = time.strptime(t, "%m/%d/%Y") 
strTime = time.strftime("%Y-%m-%d", timeStruct) 
print(strTime)

2016-03-31

In [41]:
for i in range(0,d1.shape[0]):
    t=d1['published_date'][i]
    timeStruct = time.strptime(t, "%m/%d/%Y") 
    d1['published_date'][i] = time.strftime("%Y-%m-%d", timeStruct) 
    
d1.head()

C:\Users\YuNan\anaconda3\envs\tf-gpu\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

  published_date  compound    neg       neu       pos
0     2016-03-31 -0.440400  0.195  0.805000  0.000000
1     2018-02-08 -0.133200  0.100  0.900000  0.000000
2     2018-02-09  0.153100  0.000  0.882000  0.118000
3     2018-02-13  0.357175  0.000  0.774000  0.226000
4     2018-02-14  0.009267  0.183  0.604667  0.212333

In [42]:
# for i in range(0,d2.shape[0]):
#     t=d2['published_date'][i]
#     timeStruct = time.strptime(t, "%Y/%m/%d") 
#     d2['published_date'][i] = time.strftime("%Y-%m-%d", timeStruct) 
    
# for i in range(0,d3.shape[0]):
#     t=d3['published_date'][i]
#     timeStruct = time.strptime(t, "%Y/%m/%d") 
#     d3['published_date'][i] = time.strftime("%Y-%m-%d", timeStruct) 
    
# for i in range(0,d4.shape[0]):
#     t=d4['published_date'][i]
#     timeStruct = time.strptime(t, "%Y/%m/%d") 
#     d4['published_date'][i] = time.strftime("%Y-%m-%d", timeStruct)

In[17]:

In[30]:

In [43]:
d1.head()

  published_date  compound    neg       neu       pos
0     2016-03-31 -0.440400  0.195  0.805000  0.000000
1     2018-02-08 -0.133200  0.100  0.900000  0.000000
2     2018-02-09  0.153100  0.000  0.882000  0.118000
3     2018-02-13  0.357175  0.000  0.774000  0.226000
4     2018-02-14  0.009267  0.183  0.604667  0.212333

In [60]:
sp1['date'] = sp1['t'].apply(lambda x: x.split(' '))
sp1['Date'] = sp1['date'].apply(lambda x: x[0])
sp1['time'] = sp1['date'].apply(lambda x: x[1])

In [70]:
sp1.drop_duplicates(subset=['Date'], keep='last', inplace = True)
print(sp1.shape)
sp1.head

(1364, 12)

<bound method NDFrame.head of         Unnamed: 0        v        vw         o         c         h         l  \
391            391    300.0  146.4000  146.4000  146.4000  146.4000  146.4000
782         788149  22618.0  144.8237  144.5900  144.5900  144.5900  144.5900
1186        787745    100.0  140.9900  140.9900  140.9900  140.9900  140.9900
1588        787343   7257.0  140.8824  140.8300  140.8300  141.0700  140.8300
1994        786937    682.0  138.5219  138.5200  138.5200  138.5200  138.5200
...            ...      ...       ...       ...       ...       ...       ...
627690        1902    100.0  210.9999  210.9999  210.9999  210.9999  210.9999
627708        1884    498.0  211.0780  211.0700  211.0900  211.0900  211.0700
628257        1335    100.0  216.5001  216.5001  216.5001  216.5001  216.5001
628793         799    208.0  215.7493  215.7500  215.7500  215.7500  215.7500
628809         783    916.0  216.0432  216.1000  216.0000  216.1000  216.0000

                          t     n                    date        Date  \
391     2015-12-30 23:36:00   1.0  [2015-12-30, 23:36:00]  2015-12-30
782     2015-12-31 21:00:00  15.0  [2015-12-31, 21:00:00]  2015-12-31
1186    2016-01-04 23:53:00   1.0  [2016-01-04, 23:53:00]  2016-01-04
1588    2016-01-05 21:07:00   2.0  [2016-01-05, 21:07:00]  2016-01-05
1994    2016-01-06 21:15:00   7.0  [2016-01-06, 21:15:00]  2016-01-06
...                     ...   ...                     ...         ...
627690  2021-02-12 23:59:00   1.0  [2021-02-12, 23:59:00]  2021-02-12
627708  2021-02-13 00:59:00   6.0  [2021-02-13, 00:59:00]  2021-02-13
628257  2021-02-16 23:59:00   1.0  [2021-02-16, 23:59:00]  2021-02-16
628793  2021-02-17 23:57:00   4.0  [2021-02-17, 23:57:00]  2021-02-17
628809  2021-02-18 00:59:00   8.0  [2021-02-18, 00:59:00]  2021-02-18

            time
391     23:36:00
782     21:00:00
1186    23:53:00
1588    21:07:00
1994    21:15:00
...          ...
627690  23:59:00
627708  00:59:00
628257  23:59:00
628793  23:57:00
628809  00:59:00

[1364 rows x 12 columns]>

In [73]:
sp1.reset_index(inplace = True)
sp1

,index,Unnamed: 0,v,vw,o,c,h,l,t,n,date,Date,time
0,391,391,300.0,146.4000,146.4000,146.4000,146.4000,146.4000,2015-12-30 23:36:00,1.0,"[2015-12-30, 23:36:00]",2015-12-30,23:36:00
1,782,788149,22618.0,144.8237,144.5900,144.5900,144.5900,144.5900,2015-12-31 21:00:00,15.0,"[2015-12-31, 21:00:00]",2015-12-31,21:00:00
2,1186,787745,100.0,140.9900,140.9900,140.9900,140.9900,140.9900,2016-01-04 23:53:00,1.0,"[2016-01-04, 23:53:00]",2016-01-04,23:53:00
3,1588,787343,7257.0,140.8824,140.8300,140.8300,141.0700,140.8300,2016-01-05 21:07:00,2.0,"[2016-01-05, 21:07:00]",2016-01-05,21:07:00
4,1994,786937,682.0,138.5219,138.5200,138.5200,138.5200,138.5200,2016-01-06 21:15:00,7.0,"[2016-01-06, 21:15:00]",2016-01-06,21:15:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1359,627690,1902,100.0,210.9999,210.9999,210.9999,210.9999,210.9999,2021-02-12 23:59:00,1.0,"[2021-02-12, 23:59:00]",2021-02-12,23:59:00
1360,627708,1884,498.0,211.0780,211.0700,211.0900,211.0900,211.0700,2021-02-13 00:59:00,6.0,"[2021-02-13, 00:59:00]",2021-02-13,00:59:00
1361,628257,1335,100.0,216.5001,216.5001,216.5001,216.5001,216.5001,2021-02-16 23:59:00,1.0,"[2021-02-16, 23:59:00]",2021-02-16,23:59:00
1362,628793,799,208.0,215.7493,215.7500,215.7500,215.7500,215.7500,2021-02-17 23:57:00,4.0,"[2021-02-17, 23:57:00]",2021-02-17,23:57:00
1363,628809,783,916.0,216.0432,216.1000,216.0000,216.1000,216.0000,2021-02-18 00:59:00,8.0,"[2021-02-18, 00:59:00]",2021-02-18,00:59:00

In [74]:
date_union_1=pd.DataFrame(columns=('idx','date','mean_compound','comp_flag'))
sp_len=sp1.shape[0]
d_len=d1.shape[0]
d=d1.copy()
for i in range(0,sp_len):
    idx=i
    date=sp1['Date'][i]
    j=0
    t=0
    while j<d_len:
        if sp1['Date'][i]==d['published_date'][j]:
            mean_compound=d['compound'][j]
            comp_flag=1
            t=1
            break
        j=j+1
    if t==0:
        mean_compound=0
        comp_flag=0
    
    date_union_1=date_union_1.append(pd.DataFrame({'idx':[idx],
                                                  'date':[date],
                                                  'mean_compound':[mean_compound],
                                                  'comp_flag':[comp_flag]
        
    }),ignore_index=True)

In [77]:
date_union_1.shape

(1364, 4)

In [79]:
date_union_1[600:700]

     idx        date mean_compound comp_flag
600  600  2018-04-19       -0.1027         1
601  601  2018-04-20             0         1
602  602  2018-04-23             0         1
603  603  2018-04-24      0.134867         1
604  604  2018-04-25     0.0451909         1
..   ...         ...           ...       ...
695  695  2018-09-04             0         0
696  696  2018-09-05             0         1
697  697  2018-09-06         0.128         1
698  698  2018-09-07             0         0
699  699  2018-09-10       0.31845         1

[100 rows x 4 columns]

In [80]:
date_union_1.to_csv('new_date_union_1.csv')